<center><img src='https://raw.githubusercontent.com/Jangrae/img/master/title.png' width=500/></center>

<center><img src='https://raw.githubusercontent.com/Jangrae/img/master/practice.png' width=300/></center>

# 실습 목표

- 데이터를 집계할 수 있습니다.
- 열 이름을 바꿀 수 있습니다.
- 데이터프레임을 연결할 수 있습니다.

# P4. [실습] 데이터프레임 집계

In [0]:
# 라이브러리와 불러오기
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [0]:
# 파일 읽어오기
graduate_file = 'https://raw.githubusercontent.com/Jangrae/csv/master/Graduate_apply.csv'
titanic_file = 'https://raw.githubusercontent.com/Jangrae/csv/master/titanic_simple.csv'

graduate = pd.read_csv(graduate_file, sep = ',') 
titanic = pd.read_csv(titanic_file, sep = ',')

## graduate 데이터프레임 사용

1) **groupby()** 메소드를 사용해 rank, admit 별 gre의 최댓값을 집계해서 **df_max** 데이터프레임을 만드세요.

In [6]:
# rank, admit 별 gre의 최댓값
df_max = graduate.groupby(by=['rank', 'admit'], as_index=False)[['gre']].max()

# 확인
df_max.head()

   rank  admit  gre
0     1      0  800
1     1      1  800
2     2      0  800
3     2      1  800
4     3      0  800

2) **rename()** 메소드를 사용해 df_max 데이터프레임의 gre 열 이름을 gre_max로 변경하세요.

In [7]:
# df_max 열 이름 변경: gre --> gre_max
df_max.rename(columns={'gre': 'gre_max'}, inplace=True)

# 확인
df_max.head()

   rank  admit  gre_max
0     1      0      800
1     1      1      800
2     2      0      800
3     2      1      800
4     3      0      800

3) rank, admit 별 gre의 최솟값을 집계해서 **df_min** 데이터프레임을 만드세요.

In [8]:
# rank, admit 별 gre의 최솟값
df_min = graduate.groupby(by=['rank', 'admit'], as_index=False)[['gre']].min()

# 확인
df_min.head()

   rank  admit  gre
0     1      0  340
1     1      1  460
2     2      0  380
3     2      1  300
4     3      0  220

4) df_min 데이터프레임의 gre 열 이름을열 이름을 gre_min으로 변경하세요.

In [9]:
# df_max 열 이름 변경: gre --> gre_min
df_min.rename(columns={'gre': 'gre_min'}, inplace=True)

# 확인
df_min.head()

   rank  admit  gre_min
0     1      0      340
1     1      1      460
2     2      0      380
3     2      1      300
4     3      0      220

5) **concat()** 함수를 사용해 df_max, df_min 데이터프레임을 붙여 **df_graduate** 데이터프레임을 만드세요.

- 단, rank, admit, gre_max, gre_min을 갖는 데이터프레임이 되게 하세요.

In [11]:
# 데이터프레임 연결
df_graduate = pd.concat([df_max, df_min['gre_min']], axis=1)

# 확인
df_graduate.head()

   rank  admit  gre_max  gre_min
0     1      0      800      340
1     1      1      800      460
2     2      0      800      380
3     2      1      800      300
4     3      0      800      220

6) gre_max에서 gre_min을 뺀 결괏값을 df_graduate 데이터프레임에 **gre_range** 열로 추가하세요.

In [12]:
# gre_range 열 추가
df_graduate['gre_range'] = df_graduate['gre_max'] - df_graduate['gre_min']

# 확인
df_graduate.head()

   rank  admit  gre_max  gre_min  gre_range
0     1      0      800      340        460
1     1      1      800      460        340
2     2      0      800      380        420
3     2      1      800      300        500
4     3      0      800      220        580

## titanic 데이터프레임 사용

7) 탑승지역(Embarked)별, 성별별, 평균 나이를 조회하세요.

In [15]:
titanic.head()

   PassengerId  Survived  Pclass  ...   Age     Fare      Embarked
0            1         0       3  ...  22.0   7.2500  Southhampton
1            2         1       1  ...  38.0  71.2833     Cherbourg
2            3         1       3  ...  26.0   7.9250  Southhampton
3            4         1       1  ...  35.0  53.1000  Southhampton
4            5         0       3  ...  35.0   8.0500  Southhampton

[5 rows x 8 columns]

In [13]:
# 탑승지역별, 성별별, 평균 나이
titanic.groupby(by=['Embarked', 'Sex'], as_index=False)['Age'].mean()

       Embarked     Sex        Age
0     Cherbourg  female  28.344262
1     Cherbourg    male  32.998841
2    Queenstown  female  24.291667
3    Queenstown    male  30.937500
4  Southhampton  female  27.771505
5  Southhampton    male  30.291440

8) 객실등급별, 탑승지역별, 승객 수를 조회하세요.

In [18]:
# 객실등급별, 탑승지역별, 승객 수
titanic.groupby(by=['Pclass', 'Embarked'], as_index=False)['PassengerId'].count()

   Pclass      Embarked  PassengerId
0       1     Cherbourg           85
1       1    Queenstown            2
2       1  Southhampton          127
3       2     Cherbourg           17
4       2    Queenstown            3
5       2  Southhampton          164
6       3     Cherbourg           66
7       3    Queenstown           72
8       3  Southhampton          353

In [22]:
titanic_1 = titanic.groupby(by=['Pclass', 'Embarked'], as_index=False)['PassengerId'].count()
titanic_1.rename(columns={'PassengerId': 'Num_of_passenger'}, inplace=True)
titanic_1

   Pclass      Embarked  Num_of_passenger
0       1     Cherbourg                85
1       1    Queenstown                 2
2       1  Southhampton               127
3       2     Cherbourg                17
4       2    Queenstown                 3
5       2  Southhampton               164
6       3     Cherbourg                66
7       3    Queenstown                72
8       3  Southhampton               353

## <center>수고하셨습니다.</center>
<center><img src='https://raw.githubusercontent.com/Jangrae/img/master/end.png' width=200/></center>